# Pandas library

- Pandas is one of the python library which deals with data manipulation,cleaning,preprocessing etc
- Pandas is applied for different formats like excel,csv,json etc

In [1]:
pip install pandas

Requirement already satisfied: pandas in c:\programdata\anaconda3\lib\site-packages (1.1.3)
Requirement already satisfied: pytz>=2017.2 in c:\programdata\anaconda3\lib\site-packages (from pandas) (2020.1)
Requirement already satisfied: numpy>=1.15.4 in c:\programdata\anaconda3\lib\site-packages (from pandas) (1.19.2)
Requirement already satisfied: python-dateutil>=2.7.3 in c:\programdata\anaconda3\lib\site-packages (from pandas) (2.8.1)
Requirement already satisfied: six>=1.5 in c:\programdata\anaconda3\lib\site-packages (from python-dateutil>=2.7.3->pandas) (1.15.0)
Note: you may need to restart the kernel to use updated packages.

In [2]:
import pandas as pd

# Types
-series:1-D array
-DataFrames: It is a format of rows and columns

# series
-pd.series

In [3]:
print(dir(pd))

['BooleanDtype', 'Categorical', 'CategoricalDtype', 'CategoricalIndex', 'DataFrame', 'DateOffset', 'DatetimeIndex', 'DatetimeTZDtype', 'ExcelFile', 'ExcelWriter', 'Float64Index', 'Grouper', 'HDFStore', 'Index', 'IndexSlice', 'Int16Dtype', 'Int32Dtype', 'Int64Dtype', 'Int64Index', 'Int8Dtype', 'Interval', 'IntervalDtype', 'IntervalIndex', 'MultiIndex', 'NA', 'NaT', 'NamedAgg', 'Period', 'PeriodDtype', 'PeriodIndex', 'RangeIndex', 'Series', 'SparseDtype', 'StringDtype', 'Timedelta', 'TimedeltaIndex', 'Timestamp', 'UInt16Dtype', 'UInt32Dtype', 'UInt64Dtype', 'UInt64Index', 'UInt8Dtype', '__builtins__', '__cached__', '__doc__', '__docformat__', '__file__', '__getattr__', '__git_version__', '__loader__', '__name__', '__package__', '__path__', '__spec__', '__version__', '_config', '_hashtable', '_is_numpy_dev', '_lib', '_libs', '_np_version_under1p16', '_np_version_under1p17', '_np_version_under1p18', '_testing', '_tslib', '_typing', '_version', 'api', 'array', 'arrays', 'bdate_range', 'compat', 'concat', 'core', 'crosstab', 'cut', 'date_range', 'describe_option', 'errors', 'eval', 'factorize', 'get_dummies', 'get_option', 'infer_freq', 'interval_range', 'io', 'isna', 'isnull', 'json_normalize', 'lreshape', 'melt', 'merge', 'merge_asof', 'merge_ordered', 'notna', 'notnull', 'offsets', 'option_context', 'options', 'pandas', 'period_range', 'pivot', 'pivot_table', 'plotting', 'qcut', 'read_clipboard', 'read_csv', 'read_excel', 'read_feather', 'read_fwf', 'read_gbq', 'read_hdf', 'read_html', 'read_json', 'read_orc', 'read_parquet', 'read_pickle', 'read_sas', 'read_spss', 'read_sql', 'read_sql_query', 'read_sql_table', 'read_stata', 'read_table', 'reset_option', 'set_eng_float_format', 'set_option', 'show_versions', 'test', 'testing', 'timedelta_range', 'to_datetime', 'to_numeric', 'to_pickle', 'to_timedelta', 'tseries', 'unique', 'util', 'value_counts', 'wide_to_long']

In [4]:
help(pd.series)

AttributeError: module 'pandas' has no attribute 'series'

In [ ]:
help(pd.Series)

# different ways to create series

-list
-tuples
-dictionaries
-numpy array

In [ ]:
# create series using list
s1=pd.Series([10,11,12,13,14,15])
s1

In [ ]:
# create series using tuple
s2=pd.Series((10,11,13,12))

In [ ]:
s2

In [ ]:
# create series using Dictionary
dict3={'a':11,'b':12,'c':13,'d':14}
s3=pd.Series(dict3)

In [ ]:
s3

In [ ]:
# Create a series using numpy
import numpy as np
s4=pd.Series(np.array([1,2,3,4,5]))
s4

# Operations between Series(+-/*)

In [ ]:
s5=pd.Series([121,1255,899,1000,55])

In [ ]:
s6=pd.Series([234,500,768,1012,2000])

In [ ]:
print(s5+s6)

In [ ]:
print(s5-s6)

In [ ]:
print(s5/s6)

In [ ]:
print(s5*s6)

In [ ]:
# for userdefined index position to the values
s7=pd.Series([234,500,768,1012,2000],index=['5','7','9','11','45'])
s7

# Data frame
-pd.DataFrame()

In [ ]:
help(pd.DataFrame)

# Create DataFrame

In [ ]:
dict1={'Trainers':['Mounika','siva','Madevi'],'Subjects':['Python','DA','ML'],'id':[123,342,234]}
df1=pd.DataFrame(dict1)
df1

# Indexing

-Selecting Rows
    - df[stat_val:stop_val].
-Selecting
    - df['col_name_'] or df.col_name
  -Selecting multiple columns
   - df[['col_name1','col-name2',...]]

In [ ]:
df1

In [ ]:
df1[0:1]

In [ ]:
df1['Trainers']

In [ ]:
df1['id']

In [ ]:
df1['id'][2]

In [ ]:
df1[2]

# iloc and loc
- iloc: position based inex
- loc: label based index

In [ ]:
df1.iloc[2]

In [ ]:
df1.loc[2]

In [ ]:
type(df1.loc[2])

In [ ]:
type(df1.iloc[2])

In [ ]:
df1.iloc[0:2,2]

In [ ]:
df1[['Trainers','Subjects']]

In [ ]:
df1.loc['0':'1',['Trainers','Subjects']]

In [11]:
dt1={'Sports':['cricket','hockey','coco'],
     'score':[9,7,8.6],
     'team':['csi','mi','rcb']}
df1=pd.DataFrame(dt1,index=['A','B','C'])

In [12]:
dt2={'sports':['TempleRun','Pubg','Ludo'],'Score':[5,6,7],'team':['Geeks','edyst','coursera']}
df2=pd.DataFrame(dt2,index=['A','B','C'])

In [13]:
dt1

{'Sports': ['cricket', 'hockey', 'coco'],
 'score': [9, 7, 8.6],
 'team': ['csi', 'mi', 'rcb']}

In [14]:
dt2

{'sports': ['TempleRun', 'Pubg', 'Ludo'],
 'Score': [5, 6, 7],
 'team': ['Geeks', 'edyst', 'coursera']}

In [15]:
d=pd.DataFrame(dt1)
d

    Sports  score team
0  cricket    9.0  csi
1   hockey    7.0   mi
2     coco    8.6  rcb

In [16]:
pd.concat([df1,df2])

    Sports  score      team     sports  Score
A  cricket    9.0       csi        NaN    NaN
B   hockey    7.0        mi        NaN    NaN
C     coco    8.6       rcb        NaN    NaN
A      NaN    NaN     Geeks  TempleRun    5.0
B      NaN    NaN     edyst       Pubg    6.0
C      NaN    NaN  coursera       Ludo    7.0

In [17]:
pd.concat([df1,df2],axis=1)

    Sports  score team     sports  Score      team
A  cricket    9.0  csi  TempleRun      5     Geeks
B   hockey    7.0   mi       Pubg      6     edyst
C     coco    8.6  rcb       Ludo      7  coursera

# Adding a row and column

In [18]:
df1

    Sports  score team
A  cricket    9.0  csi
B   hockey    7.0   mi
C     coco    8.6  rcb

In [20]:
df1.append({'Sports':'Basketbal','score':10,'team':'knr'},ignore_index=True)

      Sports  score team
0    cricket    9.0  csi
1     hockey    7.0   mi
2       coco    8.6  rcb
3  Basketbal   10.0  knr

In [21]:
df1.append({'score':7,'Sports':'Shuttle','team':'Sunrisers'},ignore_index=True)

    Sports  score       team
0  cricket    9.0        csi
1   hockey    7.0         mi
2     coco    8.6        rcb
3  Shuttle    7.0  Sunrisers

In [22]:
df1

    Sports  score team
A  cricket    9.0  csi
B   hockey    7.0   mi
C     coco    8.6  rcb

In [23]:
df1['win/lost']=['win','lost','win']

In [24]:
df1

    Sports  score team win/lost
A  cricket    9.0  csi      win
B   hockey    7.0   mi     lost
C     coco    8.6  rcb      win

# Getting and Loading dataset